kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM34Z5_v1_6.c
void test_AIPS(void) {
  (void)AIPS_BASE;
  (void)AIPS;
  AIPS_PACRA = AIPS_PACRA + 1;
  AIPS_PACRB = AIPS_PACRB + 1;
  AIPS_PACRE = AIPS_PACRE + 1;
  AIPS_PACRF = AIPS_PACRF + 1;
  AIPS_PACRG = AIPS_PACRG + 1;
  AIPS_PACRH = AIPS_PACRH + 1;
  AIPS_PACRI = AIPS_PACRI + 1;
  AIPS_PACRJ = AIPS_PACRJ + 1;
  AIPS_PACRK = AIPS_PACRK + 1;
  AIPS_PACRL = AIPS_PACRL + 1;
  AIPS_PACRM = AIPS_PACRM + 1;
  AIPS_PACRN = AIPS_PACRN + 1;
  AIPS_PACRO = AIPS_PACRO + 1;
  AIPS_PACRP = AIPS_PACRP + 1;
  AIPS_PACRA_REG(AIPS) = AIPS_PACRA_REG(AIPS) + 1;
  (void)AIPS_PACRA_AC7_MASK;
  (void)AIPS_PACRA_AC7_SHIFT;
  (void)AIPS_PACRA_AC7(1);
  AIPS_PACRA |= AIPS_PACRA_AC7_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_AC7_SHIFT);
  (void)AIPS_PACRA_RO7_MASK;
  (void)AIPS_PACRA_RO7_SHIFT;
  AIPS_PACRA |= AIPS_PACRA_RO7_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_RO7_SHIFT);
  (void)AIPS_PACRA_AC6_MASK;
  (void)AIPS_PACRA_AC6_SHIFT;
  (void)AIPS_PACRA_AC6(1);
  AIPS_PACRA |= AIPS_PACRA_AC6_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_AC6_SHIFT);
  (void)AIPS_PACRA_RO6_MASK;
  (void)AIPS_PACRA_RO6_SHIFT;
  AIPS_PACRA |= AIPS_PACRA_RO6_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_RO6_SHIFT);
  (void)AIPS_PACRA_AC5_MASK;
  (void)AIPS_PACRA_AC5_SHIFT;
  (void)AIPS_PACRA_AC5(1);
  AIPS_PACRA |= AIPS_PACRA_AC5_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_AC5_SHIFT);
  (void)AIPS_PACRA_RO5_MASK;
  (void)AIPS_PACRA_RO5_SHIFT;
  AIPS_PACRA |= AIPS_PACRA_RO5_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_RO5_SHIFT);
  (void)AIPS_PACRA_AC4_MASK;
  (void)AIPS_PACRA_AC4_SHIFT;
  (void)AIPS_PACRA_AC4(1);
  AIPS_PACRA |= AIPS_PACRA_AC4_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_AC4_SHIFT);
  (void)AIPS_PACRA_RO4_MASK;
  (void)AIPS_PACRA_RO4_SHIFT;
  AIPS_PACRA |= AIPS_PACRA_RO4_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_RO4_SHIFT);
  (void)AIPS_PACRA_AC3_MASK;
  (void)AIPS_PACRA_AC3_SHIFT;
  (void)AIPS_PACRA_AC3(1);
  AIPS_PACRA |= AIPS_PACRA_AC3_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_AC3_SHIFT);
  (void)AIPS_PACRA_RO3_MASK;
  (void)AIPS_PACRA_RO3_SHIFT;
  AIPS_PACRA |= AIPS_PACRA_RO3_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_RO3_SHIFT);
  (void)AIPS_PACRA_AC2_MASK;
  (void)AIPS_PACRA_AC2_SHIFT;
  (void)AIPS_PACRA_AC2(1);
  AIPS_PACRA |= AIPS_PACRA_AC2_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_AC2_SHIFT);
  (void)AIPS_PACRA_RO2_MASK;
  (void)AIPS_PACRA_RO2_SHIFT;
  AIPS_PACRA |= AIPS_PACRA_RO2_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_RO2_SHIFT);
  (void)AIPS_PACRA_AC1_MASK;
  (void)AIPS_PACRA_AC1_SHIFT;
  (void)AIPS_PACRA_AC1(1);
  AIPS_PACRA |= AIPS_PACRA_AC1_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_AC1_SHIFT);
  (void)AIPS_PACRA_RO1_MASK;
  (void)AIPS_PACRA_RO1_SHIFT;
  AIPS_PACRA |= AIPS_PACRA_RO1_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_RO1_SHIFT);
  (void)AIPS_PACRA_AC0_MASK;
  (void)AIPS_PACRA_AC0_SHIFT;
  (void)AIPS_PACRA_AC0(1);
  AIPS_PACRA |= AIPS_PACRA_AC0_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_AC0_SHIFT);
  (void)AIPS_PACRA_RO0_MASK;
  (void)AIPS_PACRA_RO0_SHIFT;
  AIPS_PACRA |= AIPS_PACRA_RO0_MASK;
  AIPS_PACRA &= ~(1U << AIPS_PACRA_RO0_SHIFT);
  AIPS_PACRB_REG(AIPS) = AIPS_PACRB_REG(AIPS) + 1;
  (void)AIPS_PACRB_AC7_MASK;
  (void)AIPS_PACRB_AC7_SHIFT;
  (void)AIPS_PACRB_AC7(1);
  AIPS_PACRB |= AIPS_PACRB_AC7_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_AC7_SHIFT);
  (void)AIPS_PACRB_RO7_MASK;
  (void)AIPS_PACRB_RO7_SHIFT;
  AIPS_PACRB |= AIPS_PACRB_RO7_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_RO7_SHIFT);
  (void)AIPS_PACRB_AC6_MASK;
  (void)AIPS_PACRB_AC6_SHIFT;
  (void)AIPS_PACRB_AC6(1);
  AIPS_PACRB |= AIPS_PACRB_AC6_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_AC6_SHIFT);
  (void)AIPS_PACRB_RO6_MASK;
  (void)AIPS_PACRB_RO6_SHIFT;
  AIPS_PACRB |= AIPS_PACRB_RO6_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_RO6_SHIFT);
  (void)AIPS_PACRB_AC5_MASK;
  (void)AIPS_PACRB_AC5_SHIFT;
  (void)AIPS_PACRB_AC5(1);
  AIPS_PACRB |= AIPS_PACRB_AC5_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_AC5_SHIFT);
  (void)AIPS_PACRB_RO5_MASK;
  (void)AIPS_PACRB_RO5_SHIFT;
  AIPS_PACRB |= AIPS_PACRB_RO5_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_RO5_SHIFT);
  (void)AIPS_PACRB_AC4_MASK;
  (void)AIPS_PACRB_AC4_SHIFT;
  (void)AIPS_PACRB_AC4(1);
  AIPS_PACRB |= AIPS_PACRB_AC4_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_AC4_SHIFT);
  (void)AIPS_PACRB_RO4_MASK;
  (void)AIPS_PACRB_RO4_SHIFT;
  AIPS_PACRB |= AIPS_PACRB_RO4_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_RO4_SHIFT);
  (void)AIPS_PACRB_AC3_MASK;
  (void)AIPS_PACRB_AC3_SHIFT;
  (void)AIPS_PACRB_AC3(1);
  AIPS_PACRB |= AIPS_PACRB_AC3_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_AC3_SHIFT);
  (void)AIPS_PACRB_RO3_MASK;
  (void)AIPS_PACRB_RO3_SHIFT;
  AIPS_PACRB |= AIPS_PACRB_RO3_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_RO3_SHIFT);
  (void)AIPS_PACRB_AC2_MASK;
  (void)AIPS_PACRB_AC2_SHIFT;
  (void)AIPS_PACRB_AC2(1);
  AIPS_PACRB |= AIPS_PACRB_AC2_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_AC2_SHIFT);
  (void)AIPS_PACRB_RO2_MASK;
  (void)AIPS_PACRB_RO2_SHIFT;
  AIPS_PACRB |= AIPS_PACRB_RO2_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_RO2_SHIFT);
  (void)AIPS_PACRB_AC1_MASK;
  (void)AIPS_PACRB_AC1_SHIFT;
  (void)AIPS_PACRB_AC1(1);
  AIPS_PACRB |= AIPS_PACRB_AC1_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_AC1_SHIFT);
  (void)AIPS_PACRB_RO1_MASK;
  (void)AIPS_PACRB_RO1_SHIFT;
  AIPS_PACRB |= AIPS_PACRB_RO1_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_RO1_SHIFT);
  (void)AIPS_PACRB_AC0_MASK;
  (void)AIPS_PACRB_AC0_SHIFT;
  (void)AIPS_PACRB_AC0(1);
  AIPS_PACRB |= AIPS_PACRB_AC0_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_AC0_SHIFT);
  (void)AIPS_PACRB_RO0_MASK;
  (void)AIPS_PACRB_RO0_SHIFT;
  AIPS_PACRB |= AIPS_PACRB_RO0_MASK;
  AIPS_PACRB &= ~(1U << AIPS_PACRB_RO0_SHIFT);
  AIPS_PACRE_REG(AIPS) = AIPS_PACRE_REG(AIPS) + 1;
  (void)AIPS_PACRE_AC7_MASK;
  (void)AIPS_PACRE_AC7_SHIFT;
  (void)AIPS_PACRE_AC7(1);
  AIPS_PACRE |= AIPS_PACRE_AC7_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_AC7_SHIFT);
  (void)AIPS_PACRE_RO7_MASK;
  (void)AIPS_PACRE_RO7_SHIFT;
  AIPS_PACRE |= AIPS_PACRE_RO7_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_RO7_SHIFT);
  (void)AIPS_PACRE_AC6_MASK;
  (void)AIPS_PACRE_AC6_SHIFT;
  (void)AIPS_PACRE_AC6(1);
  AIPS_PACRE |= AIPS_PACRE_AC6_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_AC6_SHIFT);
  (void)AIPS_PACRE_RO6_MASK;
  (void)AIPS_PACRE_RO6_SHIFT;
  AIPS_PACRE |= AIPS_PACRE_RO6_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_RO6_SHIFT);
  (void)AIPS_PACRE_AC5_MASK;
  (void)AIPS_PACRE_AC5_SHIFT;
  (void)AIPS_PACRE_AC5(1);
  AIPS_PACRE |= AIPS_PACRE_AC5_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_AC5_SHIFT);
  (void)AIPS_PACRE_RO5_MASK;
  (void)AIPS_PACRE_RO5_SHIFT;
  AIPS_PACRE |= AIPS_PACRE_RO5_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_RO5_SHIFT);
  (void)AIPS_PACRE_AC4_MASK;
  (void)AIPS_PACRE_AC4_SHIFT;
  (void)AIPS_PACRE_AC4(1);
  AIPS_PACRE |= AIPS_PACRE_AC4_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_AC4_SHIFT);
  (void)AIPS_PACRE_RO4_MASK;
  (void)AIPS_PACRE_RO4_SHIFT;
  AIPS_PACRE |= AIPS_PACRE_RO4_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_RO4_SHIFT);
  (void)AIPS_PACRE_AC3_MASK;
  (void)AIPS_PACRE_AC3_SHIFT;
  (void)AIPS_PACRE_AC3(1);
  AIPS_PACRE |= AIPS_PACRE_AC3_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_AC3_SHIFT);
  (void)AIPS_PACRE_RO3_MASK;
  (void)AIPS_PACRE_RO3_SHIFT;
  AIPS_PACRE |= AIPS_PACRE_RO3_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_RO3_SHIFT);
  (void)AIPS_PACRE_AC2_MASK;
  (void)AIPS_PACRE_AC2_SHIFT;
  (void)AIPS_PACRE_AC2(1);
  AIPS_PACRE |= AIPS_PACRE_AC2_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_AC2_SHIFT);
  (void)AIPS_PACRE_RO2_MASK;
  (void)AIPS_PACRE_RO2_SHIFT;
  AIPS_PACRE |= AIPS_PACRE_RO2_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_RO2_SHIFT);
  (void)AIPS_PACRE_AC1_MASK;
  (void)AIPS_PACRE_AC1_SHIFT;
  (void)AIPS_PACRE_AC1(1);
  AIPS_PACRE |= AIPS_PACRE_AC1_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_AC1_SHIFT);
  (void)AIPS_PACRE_RO1_MASK;
  (void)AIPS_PACRE_RO1_SHIFT;
  AIPS_PACRE |= AIPS_PACRE_RO1_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_RO1_SHIFT);
  (void)AIPS_PACRE_AC0_MASK;
  (void)AIPS_PACRE_AC0_SHIFT;
  (void)AIPS_PACRE_AC0(1);
  AIPS_PACRE |= AIPS_PACRE_AC0_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_AC0_SHIFT);
  (void)AIPS_PACRE_RO0_MASK;
  (void)AIPS_PACRE_RO0_SHIFT;
  AIPS_PACRE |= AIPS_PACRE_RO0_MASK;
  AIPS_PACRE &= ~(1U << AIPS_PACRE_RO0_SHIFT);
  AIPS_PACRF_REG(AIPS) = AIPS_PACRF_REG(AIPS) + 1;
  (void)AIPS_PACRF_AC7_MASK;
  (void)AIPS_PACRF_AC7_SHIFT;
  (void)AIPS_PACRF_AC7(1);
  AIPS_PACRF |= AIPS_PACRF_AC7_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_AC7_SHIFT);
  (void)AIPS_PACRF_RO7_MASK;
  (void)AIPS_PACRF_RO7_SHIFT;
  AIPS_PACRF |= AIPS_PACRF_RO7_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_RO7_SHIFT);
  (void)AIPS_PACRF_AC6_MASK;
  (void)AIPS_PACRF_AC6_SHIFT;
  (void)AIPS_PACRF_AC6(1);
  AIPS_PACRF |= AIPS_PACRF_AC6_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_AC6_SHIFT);
  (void)AIPS_PACRF_RO6_MASK;
  (void)AIPS_PACRF_RO6_SHIFT;
  AIPS_PACRF |= AIPS_PACRF_RO6_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_RO6_SHIFT);
  (void)AIPS_PACRF_AC5_MASK;
  (void)AIPS_PACRF_AC5_SHIFT;
  (void)AIPS_PACRF_AC5(1);
  AIPS_PACRF |= AIPS_PACRF_AC5_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_AC5_SHIFT);
  (void)AIPS_PACRF_RO5_MASK;
  (void)AIPS_PACRF_RO5_SHIFT;
  AIPS_PACRF |= AIPS_PACRF_RO5_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_RO5_SHIFT);
  (void)AIPS_PACRF_AC4_MASK;
  (void)AIPS_PACRF_AC4_SHIFT;
  (void)AIPS_PACRF_AC4(1);
  AIPS_PACRF |= AIPS_PACRF_AC4_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_AC4_SHIFT);
  (void)AIPS_PACRF_RO4_MASK;
  (void)AIPS_PACRF_RO4_SHIFT;
  AIPS_PACRF |= AIPS_PACRF_RO4_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_RO4_SHIFT);
  (void)AIPS_PACRF_AC3_MASK;
  (void)AIPS_PACRF_AC3_SHIFT;
  (void)AIPS_PACRF_AC3(1);
  AIPS_PACRF |= AIPS_PACRF_AC3_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_AC3_SHIFT);
  (void)AIPS_PACRF_RO3_MASK;
  (void)AIPS_PACRF_RO3_SHIFT;
  AIPS_PACRF |= AIPS_PACRF_RO3_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_RO3_SHIFT);
  (void)AIPS_PACRF_AC2_MASK;
  (void)AIPS_PACRF_AC2_SHIFT;
  (void)AIPS_PACRF_AC2(1);
  AIPS_PACRF |= AIPS_PACRF_AC2_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_AC2_SHIFT);
  (void)AIPS_PACRF_RO2_MASK;
  (void)AIPS_PACRF_RO2_SHIFT;
  AIPS_PACRF |= AIPS_PACRF_RO2_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_RO2_SHIFT);
  (void)AIPS_PACRF_AC1_MASK;
  (void)AIPS_PACRF_AC1_SHIFT;
  (void)AIPS_PACRF_AC1(1);
  AIPS_PACRF |= AIPS_PACRF_AC1_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_AC1_SHIFT);
  (void)AIPS_PACRF_RO1_MASK;
  (void)AIPS_PACRF_RO1_SHIFT;
  AIPS_PACRF |= AIPS_PACRF_RO1_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_RO1_SHIFT);
  (void)AIPS_PACRF_AC0_MASK;
  (void)AIPS_PACRF_AC0_SHIFT;
  (void)AIPS_PACRF_AC0(1);
  AIPS_PACRF |= AIPS_PACRF_AC0_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_AC0_SHIFT);
  (void)AIPS_PACRF_RO0_MASK;
  (void)AIPS_PACRF_RO0_SHIFT;
  AIPS_PACRF |= AIPS_PACRF_RO0_MASK;
  AIPS_PACRF &= ~(1U << AIPS_PACRF_RO0_SHIFT);
  AIPS_PACRG_REG(AIPS) = AIPS_PACRG_REG(AIPS) + 1;
  (void)AIPS_PACRG_AC7_MASK;
  (void)AIPS_PACRG_AC7_SHIFT;
  (void)AIPS_PACRG_AC7(1);
  AIPS_PACRG |= AIPS_PACRG_AC7_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_AC7_SHIFT);
  (void)AIPS_PACRG_RO7_MASK;
  (void)AIPS_PACRG_RO7_SHIFT;
  AIPS_PACRG |= AIPS_PACRG_RO7_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_RO7_SHIFT);
  (void)AIPS_PACRG_AC6_MASK;
  (void)AIPS_PACRG_AC6_SHIFT;
  (void)AIPS_PACRG_AC6(1);
  AIPS_PACRG |= AIPS_PACRG_AC6_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_AC6_SHIFT);
  (void)AIPS_PACRG_RO6_MASK;
  (void)AIPS_PACRG_RO6_SHIFT;
  AIPS_PACRG |= AIPS_PACRG_RO6_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_RO6_SHIFT);
  (void)AIPS_PACRG_AC5_MASK;
  (void)AIPS_PACRG_AC5_SHIFT;
  (void)AIPS_PACRG_AC5(1);
  AIPS_PACRG |= AIPS_PACRG_AC5_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_AC5_SHIFT);
  (void)AIPS_PACRG_RO5_MASK;
  (void)AIPS_PACRG_RO5_SHIFT;
  AIPS_PACRG |= AIPS_PACRG_RO5_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_RO5_SHIFT);
  (void)AIPS_PACRG_AC4_MASK;
  (void)AIPS_PACRG_AC4_SHIFT;
  (void)AIPS_PACRG_AC4(1);
  AIPS_PACRG |= AIPS_PACRG_AC4_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_AC4_SHIFT);
  (void)AIPS_PACRG_RO4_MASK;
  (void)AIPS_PACRG_RO4_SHIFT;
  AIPS_PACRG |= AIPS_PACRG_RO4_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_RO4_SHIFT);
  (void)AIPS_PACRG_AC3_MASK;
  (void)AIPS_PACRG_AC3_SHIFT;
  (void)AIPS_PACRG_AC3(1);
  AIPS_PACRG |= AIPS_PACRG_AC3_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_AC3_SHIFT);
  (void)AIPS_PACRG_RO3_MASK;
  (void)AIPS_PACRG_RO3_SHIFT;
  AIPS_PACRG |= AIPS_PACRG_RO3_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_RO3_SHIFT);
  (void)AIPS_PACRG_AC2_MASK;
  (void)AIPS_PACRG_AC2_SHIFT;
  (void)AIPS_PACRG_AC2(1);
  AIPS_PACRG |= AIPS_PACRG_AC2_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_AC2_SHIFT);
  (void)AIPS_PACRG_RO2_MASK;
  (void)AIPS_PACRG_RO2_SHIFT;
  AIPS_PACRG |= AIPS_PACRG_RO2_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_RO2_SHIFT);
  (void)AIPS_PACRG_AC1_MASK;
  (void)AIPS_PACRG_AC1_SHIFT;
  (void)AIPS_PACRG_AC1(1);
  AIPS_PACRG |= AIPS_PACRG_AC1_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_AC1_SHIFT);
  (void)AIPS_PACRG_RO1_MASK;
  (void)AIPS_PACRG_RO1_SHIFT;
  AIPS_PACRG |= AIPS_PACRG_RO1_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_RO1_SHIFT);
  (void)AIPS_PACRG_AC0_MASK;
  (void)AIPS_PACRG_AC0_SHIFT;
  (void)AIPS_PACRG_AC0(1);
  AIPS_PACRG |= AIPS_PACRG_AC0_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_AC0_SHIFT);
  (void)AIPS_PACRG_RO0_MASK;
  (void)AIPS_PACRG_RO0_SHIFT;
  AIPS_PACRG |= AIPS_PACRG_RO0_MASK;
  AIPS_PACRG &= ~(1U << AIPS_PACRG_RO0_SHIFT);
  AIPS_PACRH_REG(AIPS) = AIPS_PACRH_REG(AIPS) + 1;
  (void)AIPS_PACRH_AC7_MASK;
  (void)AIPS_PACRH_AC7_SHIFT;
  (void)AIPS_PACRH_AC7(1);
  AIPS_PACRH |= AIPS_PACRH_AC7_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_AC7_SHIFT);
  (void)AIPS_PACRH_RO7_MASK;
  (void)AIPS_PACRH_RO7_SHIFT;
  AIPS_PACRH |= AIPS_PACRH_RO7_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_RO7_SHIFT);
  (void)AIPS_PACRH_AC6_MASK;
  (void)AIPS_PACRH_AC6_SHIFT;
  (void)AIPS_PACRH_AC6(1);
  AIPS_PACRH |= AIPS_PACRH_AC6_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_AC6_SHIFT);
  (void)AIPS_PACRH_RO6_MASK;
  (void)AIPS_PACRH_RO6_SHIFT;
  AIPS_PACRH |= AIPS_PACRH_RO6_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_RO6_SHIFT);
  (void)AIPS_PACRH_AC5_MASK;
  (void)AIPS_PACRH_AC5_SHIFT;
  (void)AIPS_PACRH_AC5(1);
  AIPS_PACRH |= AIPS_PACRH_AC5_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_AC5_SHIFT);
  (void)AIPS_PACRH_RO5_MASK;
  (void)AIPS_PACRH_RO5_SHIFT;
  AIPS_PACRH |= AIPS_PACRH_RO5_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_RO5_SHIFT);
  (void)AIPS_PACRH_AC4_MASK;
  (void)AIPS_PACRH_AC4_SHIFT;
  (void)AIPS_PACRH_AC4(1);
  AIPS_PACRH |= AIPS_PACRH_AC4_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_AC4_SHIFT);
  (void)AIPS_PACRH_RO4_MASK;
  (void)AIPS_PACRH_RO4_SHIFT;
  AIPS_PACRH |= AIPS_PACRH_RO4_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_RO4_SHIFT);
  (void)AIPS_PACRH_AC3_MASK;
  (void)AIPS_PACRH_AC3_SHIFT;
  (void)AIPS_PACRH_AC3(1);
  AIPS_PACRH |= AIPS_PACRH_AC3_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_AC3_SHIFT);
  (void)AIPS_PACRH_RO3_MASK;
  (void)AIPS_PACRH_RO3_SHIFT;
  AIPS_PACRH |= AIPS_PACRH_RO3_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_RO3_SHIFT);
  (void)AIPS_PACRH_AC2_MASK;
  (void)AIPS_PACRH_AC2_SHIFT;
  (void)AIPS_PACRH_AC2(1);
  AIPS_PACRH |= AIPS_PACRH_AC2_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_AC2_SHIFT);
  (void)AIPS_PACRH_RO2_MASK;
  (void)AIPS_PACRH_RO2_SHIFT;
  AIPS_PACRH |= AIPS_PACRH_RO2_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_RO2_SHIFT);
  (void)AIPS_PACRH_AC1_MASK;
  (void)AIPS_PACRH_AC1_SHIFT;
  (void)AIPS_PACRH_AC1(1);
  AIPS_PACRH |= AIPS_PACRH_AC1_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_AC1_SHIFT);
  (void)AIPS_PACRH_RO1_MASK;
  (void)AIPS_PACRH_RO1_SHIFT;
  AIPS_PACRH |= AIPS_PACRH_RO1_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_RO1_SHIFT);
  (void)AIPS_PACRH_AC0_MASK;
  (void)AIPS_PACRH_AC0_SHIFT;
  (void)AIPS_PACRH_AC0(1);
  AIPS_PACRH |= AIPS_PACRH_AC0_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_AC0_SHIFT);
  (void)AIPS_PACRH_RO0_MASK;
  (void)AIPS_PACRH_RO0_SHIFT;
  AIPS_PACRH |= AIPS_PACRH_RO0_MASK;
  AIPS_PACRH &= ~(1U << AIPS_PACRH_RO0_SHIFT);
  AIPS_PACRI_REG(AIPS) = AIPS_PACRI_REG(AIPS) + 1;
  (void)AIPS_PACRI_AC7_MASK;
  (void)AIPS_PACRI_AC7_SHIFT;
  (void)AIPS_PACRI_AC7(1);
  AIPS_PACRI |= AIPS_PACRI_AC7_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_AC7_SHIFT);
  (void)AIPS_PACRI_RO7_MASK;
  (void)AIPS_PACRI_RO7_SHIFT;
  AIPS_PACRI |= AIPS_PACRI_RO7_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_RO7_SHIFT);
  (void)AIPS_PACRI_AC6_MASK;
  (void)AIPS_PACRI_AC6_SHIFT;
  (void)AIPS_PACRI_AC6(1);
  AIPS_PACRI |= AIPS_PACRI_AC6_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_AC6_SHIFT);
  (void)AIPS_PACRI_RO6_MASK;
  (void)AIPS_PACRI_RO6_SHIFT;
  AIPS_PACRI |= AIPS_PACRI_RO6_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_RO6_SHIFT);
  (void)AIPS_PACRI_AC5_MASK;
  (void)AIPS_PACRI_AC5_SHIFT;
  (void)AIPS_PACRI_AC5(1);
  AIPS_PACRI |= AIPS_PACRI_AC5_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_AC5_SHIFT);
  (void)AIPS_PACRI_RO5_MASK;
  (void)AIPS_PACRI_RO5_SHIFT;
  AIPS_PACRI |= AIPS_PACRI_RO5_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_RO5_SHIFT);
  (void)AIPS_PACRI_AC4_MASK;
  (void)AIPS_PACRI_AC4_SHIFT;
  (void)AIPS_PACRI_AC4(1);
  AIPS_PACRI |= AIPS_PACRI_AC4_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_AC4_SHIFT);
  (void)AIPS_PACRI_RO4_MASK;
  (void)AIPS_PACRI_RO4_SHIFT;
  AIPS_PACRI |= AIPS_PACRI_RO4_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_RO4_SHIFT);
  (void)AIPS_PACRI_AC3_MASK;
  (void)AIPS_PACRI_AC3_SHIFT;
  (void)AIPS_PACRI_AC3(1);
  AIPS_PACRI |= AIPS_PACRI_AC3_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_AC3_SHIFT);
  (void)AIPS_PACRI_RO3_MASK;
  (void)AIPS_PACRI_RO3_SHIFT;
  AIPS_PACRI |= AIPS_PACRI_RO3_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_RO3_SHIFT);
  (void)AIPS_PACRI_AC2_MASK;
  (void)AIPS_PACRI_AC2_SHIFT;
  (void)AIPS_PACRI_AC2(1);
  AIPS_PACRI |= AIPS_PACRI_AC2_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_AC2_SHIFT);
  (void)AIPS_PACRI_RO2_MASK;
  (void)AIPS_PACRI_RO2_SHIFT;
  AIPS_PACRI |= AIPS_PACRI_RO2_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_RO2_SHIFT);
  (void)AIPS_PACRI_AC1_MASK;
  (void)AIPS_PACRI_AC1_SHIFT;
  (void)AIPS_PACRI_AC1(1);
  AIPS_PACRI |= AIPS_PACRI_AC1_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_AC1_SHIFT);
  (void)AIPS_PACRI_RO1_MASK;
  (void)AIPS_PACRI_RO1_SHIFT;
  AIPS_PACRI |= AIPS_PACRI_RO1_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_RO1_SHIFT);
  (void)AIPS_PACRI_AC0_MASK;
  (void)AIPS_PACRI_AC0_SHIFT;
  (void)AIPS_PACRI_AC0(1);
  AIPS_PACRI |= AIPS_PACRI_AC0_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_AC0_SHIFT);
  (void)AIPS_PACRI_RO0_MASK;
  (void)AIPS_PACRI_RO0_SHIFT;
  AIPS_PACRI |= AIPS_PACRI_RO0_MASK;
  AIPS_PACRI &= ~(1U << AIPS_PACRI_RO0_SHIFT);
  AIPS_PACRJ_REG(AIPS) = AIPS_PACRJ_REG(AIPS) + 1;
  (void)AIPS_PACRJ_AC7_MASK;
  (void)AIPS_PACRJ_AC7_SHIFT;
  (void)AIPS_PACRJ_AC7(1);
  AIPS_PACRJ |= AIPS_PACRJ_AC7_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_AC7_SHIFT);
  (void)AIPS_PACRJ_RO7_MASK;
  (void)AIPS_PACRJ_RO7_SHIFT;
  AIPS_PACRJ |= AIPS_PACRJ_RO7_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_RO7_SHIFT);
  (void)AIPS_PACRJ_AC6_MASK;
  (void)AIPS_PACRJ_AC6_SHIFT;
  (void)AIPS_PACRJ_AC6(1);
  AIPS_PACRJ |= AIPS_PACRJ_AC6_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_AC6_SHIFT);
  (void)AIPS_PACRJ_RO6_MASK;
  (void)AIPS_PACRJ_RO6_SHIFT;
  AIPS_PACRJ |= AIPS_PACRJ_RO6_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_RO6_SHIFT);
  (void)AIPS_PACRJ_AC5_MASK;
  (void)AIPS_PACRJ_AC5_SHIFT;
  (void)AIPS_PACRJ_AC5(1);
  AIPS_PACRJ |= AIPS_PACRJ_AC5_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_AC5_SHIFT);
  (void)AIPS_PACRJ_RO5_MASK;
  (void)AIPS_PACRJ_RO5_SHIFT;
  AIPS_PACRJ |= AIPS_PACRJ_RO5_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_RO5_SHIFT);
  (void)AIPS_PACRJ_AC4_MASK;
  (void)AIPS_PACRJ_AC4_SHIFT;
  (void)AIPS_PACRJ_AC4(1);
  AIPS_PACRJ |= AIPS_PACRJ_AC4_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_AC4_SHIFT);
  (void)AIPS_PACRJ_RO4_MASK;
  (void)AIPS_PACRJ_RO4_SHIFT;
  AIPS_PACRJ |= AIPS_PACRJ_RO4_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_RO4_SHIFT);
  (void)AIPS_PACRJ_AC3_MASK;
  (void)AIPS_PACRJ_AC3_SHIFT;
  (void)AIPS_PACRJ_AC3(1);
  AIPS_PACRJ |= AIPS_PACRJ_AC3_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_AC3_SHIFT);
  (void)AIPS_PACRJ_RO3_MASK;
  (void)AIPS_PACRJ_RO3_SHIFT;
  AIPS_PACRJ |= AIPS_PACRJ_RO3_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_RO3_SHIFT);
  (void)AIPS_PACRJ_AC2_MASK;
  (void)AIPS_PACRJ_AC2_SHIFT;
  (void)AIPS_PACRJ_AC2(1);
  AIPS_PACRJ |= AIPS_PACRJ_AC2_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_AC2_SHIFT);
  (void)AIPS_PACRJ_RO2_MASK;
  (void)AIPS_PACRJ_RO2_SHIFT;
  AIPS_PACRJ |= AIPS_PACRJ_RO2_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_RO2_SHIFT);
  (void)AIPS_PACRJ_AC1_MASK;
  (void)AIPS_PACRJ_AC1_SHIFT;
  (void)AIPS_PACRJ_AC1(1);
  AIPS_PACRJ |= AIPS_PACRJ_AC1_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_AC1_SHIFT);
  (void)AIPS_PACRJ_RO1_MASK;
  (void)AIPS_PACRJ_RO1_SHIFT;
  AIPS_PACRJ |= AIPS_PACRJ_RO1_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_RO1_SHIFT);
  (void)AIPS_PACRJ_AC0_MASK;
  (void)AIPS_PACRJ_AC0_SHIFT;
  (void)AIPS_PACRJ_AC0(1);
  AIPS_PACRJ |= AIPS_PACRJ_AC0_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_AC0_SHIFT);
  (void)AIPS_PACRJ_RO0_MASK;
  (void)AIPS_PACRJ_RO0_SHIFT;
  AIPS_PACRJ |= AIPS_PACRJ_RO0_MASK;
  AIPS_PACRJ &= ~(1U << AIPS_PACRJ_RO0_SHIFT);
  AIPS_PACRK_REG(AIPS) = AIPS_PACRK_REG(AIPS) + 1;
  (void)AIPS_PACRK_AC7_MASK;
  (void)AIPS_PACRK_AC7_SHIFT;
  (void)AIPS_PACRK_AC7(1);
  AIPS_PACRK |= AIPS_PACRK_AC7_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_AC7_SHIFT);
  (void)AIPS_PACRK_RO7_MASK;
  (void)AIPS_PACRK_RO7_SHIFT;
  AIPS_PACRK |= AIPS_PACRK_RO7_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_RO7_SHIFT);
  (void)AIPS_PACRK_AC6_MASK;
  (void)AIPS_PACRK_AC6_SHIFT;
  (void)AIPS_PACRK_AC6(1);
  AIPS_PACRK |= AIPS_PACRK_AC6_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_AC6_SHIFT);
  (void)AIPS_PACRK_RO6_MASK;
  (void)AIPS_PACRK_RO6_SHIFT;
  AIPS_PACRK |= AIPS_PACRK_RO6_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_RO6_SHIFT);
  (void)AIPS_PACRK_AC5_MASK;
  (void)AIPS_PACRK_AC5_SHIFT;
  (void)AIPS_PACRK_AC5(1);
  AIPS_PACRK |= AIPS_PACRK_AC5_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_AC5_SHIFT);
  (void)AIPS_PACRK_RO5_MASK;
  (void)AIPS_PACRK_RO5_SHIFT;
  AIPS_PACRK |= AIPS_PACRK_RO5_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_RO5_SHIFT);
  (void)AIPS_PACRK_AC4_MASK;
  (void)AIPS_PACRK_AC4_SHIFT;
  (void)AIPS_PACRK_AC4(1);
  AIPS_PACRK |= AIPS_PACRK_AC4_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_AC4_SHIFT);
  (void)AIPS_PACRK_RO4_MASK;
  (void)AIPS_PACRK_RO4_SHIFT;
  AIPS_PACRK |= AIPS_PACRK_RO4_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_RO4_SHIFT);
  (void)AIPS_PACRK_AC3_MASK;
  (void)AIPS_PACRK_AC3_SHIFT;
  (void)AIPS_PACRK_AC3(1);
  AIPS_PACRK |= AIPS_PACRK_AC3_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_AC3_SHIFT);
  (void)AIPS_PACRK_RO3_MASK;
  (void)AIPS_PACRK_RO3_SHIFT;
  AIPS_PACRK |= AIPS_PACRK_RO3_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_RO3_SHIFT);
  (void)AIPS_PACRK_AC2_MASK;
  (void)AIPS_PACRK_AC2_SHIFT;
  (void)AIPS_PACRK_AC2(1);
  AIPS_PACRK |= AIPS_PACRK_AC2_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_AC2_SHIFT);
  (void)AIPS_PACRK_RO2_MASK;
  (void)AIPS_PACRK_RO2_SHIFT;
  AIPS_PACRK |= AIPS_PACRK_RO2_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_RO2_SHIFT);
  (void)AIPS_PACRK_AC1_MASK;
  (void)AIPS_PACRK_AC1_SHIFT;
  (void)AIPS_PACRK_AC1(1);
  AIPS_PACRK |= AIPS_PACRK_AC1_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_AC1_SHIFT);
  (void)AIPS_PACRK_RO1_MASK;
  (void)AIPS_PACRK_RO1_SHIFT;
  AIPS_PACRK |= AIPS_PACRK_RO1_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_RO1_SHIFT);
  (void)AIPS_PACRK_AC0_MASK;
  (void)AIPS_PACRK_AC0_SHIFT;
  (void)AIPS_PACRK_AC0(1);
  AIPS_PACRK |= AIPS_PACRK_AC0_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_AC0_SHIFT);
  (void)AIPS_PACRK_RO0_MASK;
  (void)AIPS_PACRK_RO0_SHIFT;
  AIPS_PACRK |= AIPS_PACRK_RO0_MASK;
  AIPS_PACRK &= ~(1U << AIPS_PACRK_RO0_SHIFT);
  AIPS_PACRL_REG(AIPS) = AIPS_PACRL_REG(AIPS) + 1;
  (void)AIPS_PACRL_AC7_MASK;
  (void)AIPS_PACRL_AC7_SHIFT;
  (void)AIPS_PACRL_AC7(1);
  AIPS_PACRL |= AIPS_PACRL_AC7_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_AC7_SHIFT);
  (void)AIPS_PACRL_RO7_MASK;
  (void)AIPS_PACRL_RO7_SHIFT;
  AIPS_PACRL |= AIPS_PACRL_RO7_MASK;
  AIPS_PACRL &= ~(1U << AIPS_PACRL_RO7_SHIFT);
  (void)AIPS_PACRL_AC6_MASK;
  (void)AIPS_PACRL_AC6_SHIFT;
  (void)AIPS_PACRL_AC6(1);
  AIPS_PACRL |= AIPS_PACRL_AC6_MASK;
