kuafusoft/source_code/application/jqgrid/mcu/zzvw_device_ver/mcu_header_file/CWMCUS_V10_6_Kinetis_50MHz_KM1x_KM3x_FINAL_DROP_140717/_Test_Files/CMSIS_Test_MKM34Z5_v1_6.c
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD37_SHIFT);
  (void)LCD_WF8B_BPFLCD49_MASK;
  (void)LCD_WF8B_BPFLCD49_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD49_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD49_SHIFT);
  (void)LCD_WF8B_BPFLCD20_MASK;
  (void)LCD_WF8B_BPFLCD20_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD20_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD20_SHIFT);
  (void)LCD_WF8B_BPFLCD44_MASK;
  (void)LCD_WF8B_BPFLCD44_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD44_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD44_SHIFT);
  (void)LCD_WF8B_BPFLCD30_MASK;
  (void)LCD_WF8B_BPFLCD30_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD30_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD30_SHIFT);
  (void)LCD_WF8B_BPFLCD21_MASK;
  (void)LCD_WF8B_BPFLCD21_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD21_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD21_SHIFT);
  (void)LCD_WF8B_BPFLCD35_MASK;
  (void)LCD_WF8B_BPFLCD35_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD35_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD35_SHIFT);
  (void)LCD_WF8B_BPFLCD4_MASK;
  (void)LCD_WF8B_BPFLCD4_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD4_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD4_SHIFT);
  (void)LCD_WF8B_BPFLCD31_MASK;
  (void)LCD_WF8B_BPFLCD31_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD31_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD31_SHIFT);
  (void)LCD_WF8B_BPFLCD48_MASK;
  (void)LCD_WF8B_BPFLCD48_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD48_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD48_SHIFT);
  (void)LCD_WF8B_BPFLCD7_MASK;
  (void)LCD_WF8B_BPFLCD7_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD7_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD7_SHIFT);
  (void)LCD_WF8B_BPFLCD22_MASK;
  (void)LCD_WF8B_BPFLCD22_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD22_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD22_SHIFT);
  (void)LCD_WF8B_BPFLCD38_MASK;
  (void)LCD_WF8B_BPFLCD38_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD38_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD38_SHIFT);
  (void)LCD_WF8B_BPFLCD12_MASK;
  (void)LCD_WF8B_BPFLCD12_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD12_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD12_SHIFT);
  (void)LCD_WF8B_BPFLCD23_MASK;
  (void)LCD_WF8B_BPFLCD23_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPFLCD23_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPFLCD23_SHIFT);
  (void)LCD_WF8B_BPGLCD14_MASK;
  (void)LCD_WF8B_BPGLCD14_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD14_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD14_SHIFT);
  (void)LCD_WF8B_BPGLCD55_MASK;
  (void)LCD_WF8B_BPGLCD55_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD55_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD55_SHIFT);
  (void)LCD_WF8B_BPGLCD63_MASK;
  (void)LCD_WF8B_BPGLCD63_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD63_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD63_SHIFT);
  (void)LCD_WF8B_BPGLCD15_MASK;
  (void)LCD_WF8B_BPGLCD15_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD15_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD15_SHIFT);
  (void)LCD_WF8B_BPGLCD62_MASK;
  (void)LCD_WF8B_BPGLCD62_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD62_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD62_SHIFT);
  (void)LCD_WF8B_BPGLCD54_MASK;
  (void)LCD_WF8B_BPGLCD54_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD54_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD54_SHIFT);
  (void)LCD_WF8B_BPGLCD61_MASK;
  (void)LCD_WF8B_BPGLCD61_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD61_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD61_SHIFT);
  (void)LCD_WF8B_BPGLCD60_MASK;
  (void)LCD_WF8B_BPGLCD60_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD60_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD60_SHIFT);
  (void)LCD_WF8B_BPGLCD59_MASK;
  (void)LCD_WF8B_BPGLCD59_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD59_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD59_SHIFT);
  (void)LCD_WF8B_BPGLCD53_MASK;
  (void)LCD_WF8B_BPGLCD53_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD53_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD53_SHIFT);
  (void)LCD_WF8B_BPGLCD58_MASK;
  (void)LCD_WF8B_BPGLCD58_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD58_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD58_SHIFT);
  (void)LCD_WF8B_BPGLCD0_MASK;
  (void)LCD_WF8B_BPGLCD0_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD0_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD0_SHIFT);
  (void)LCD_WF8B_BPGLCD57_MASK;
  (void)LCD_WF8B_BPGLCD57_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD57_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD57_SHIFT);
  (void)LCD_WF8B_BPGLCD52_MASK;
  (void)LCD_WF8B_BPGLCD52_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD52_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD52_SHIFT);
  (void)LCD_WF8B_BPGLCD7_MASK;
  (void)LCD_WF8B_BPGLCD7_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD7_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD7_SHIFT);
  (void)LCD_WF8B_BPGLCD56_MASK;
  (void)LCD_WF8B_BPGLCD56_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD56_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD56_SHIFT);
  (void)LCD_WF8B_BPGLCD6_MASK;
  (void)LCD_WF8B_BPGLCD6_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD6_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD6_SHIFT);
  (void)LCD_WF8B_BPGLCD51_MASK;
  (void)LCD_WF8B_BPGLCD51_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD51_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD51_SHIFT);
  (void)LCD_WF8B_BPGLCD16_MASK;
  (void)LCD_WF8B_BPGLCD16_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD16_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD16_SHIFT);
  (void)LCD_WF8B_BPGLCD1_MASK;
  (void)LCD_WF8B_BPGLCD1_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD1_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD1_SHIFT);
  (void)LCD_WF8B_BPGLCD17_MASK;
  (void)LCD_WF8B_BPGLCD17_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD17_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD17_SHIFT);
  (void)LCD_WF8B_BPGLCD50_MASK;
  (void)LCD_WF8B_BPGLCD50_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD50_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD50_SHIFT);
  (void)LCD_WF8B_BPGLCD18_MASK;
  (void)LCD_WF8B_BPGLCD18_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD18_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD18_SHIFT);
  (void)LCD_WF8B_BPGLCD19_MASK;
  (void)LCD_WF8B_BPGLCD19_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD19_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD19_SHIFT);
  (void)LCD_WF8B_BPGLCD8_MASK;
  (void)LCD_WF8B_BPGLCD8_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD8_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD8_SHIFT);
  (void)LCD_WF8B_BPGLCD49_MASK;
  (void)LCD_WF8B_BPGLCD49_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD49_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD49_SHIFT);
  (void)LCD_WF8B_BPGLCD20_MASK;
  (void)LCD_WF8B_BPGLCD20_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD20_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD20_SHIFT);
  (void)LCD_WF8B_BPGLCD9_MASK;
  (void)LCD_WF8B_BPGLCD9_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD9_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD9_SHIFT);
  (void)LCD_WF8B_BPGLCD21_MASK;
  (void)LCD_WF8B_BPGLCD21_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD21_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD21_SHIFT);
  (void)LCD_WF8B_BPGLCD13_MASK;
  (void)LCD_WF8B_BPGLCD13_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD13_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD13_SHIFT);
  (void)LCD_WF8B_BPGLCD48_MASK;
  (void)LCD_WF8B_BPGLCD48_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD48_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD48_SHIFT);
  (void)LCD_WF8B_BPGLCD22_MASK;
  (void)LCD_WF8B_BPGLCD22_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD22_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD22_SHIFT);
  (void)LCD_WF8B_BPGLCD5_MASK;
  (void)LCD_WF8B_BPGLCD5_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD5_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD5_SHIFT);
  (void)LCD_WF8B_BPGLCD47_MASK;
  (void)LCD_WF8B_BPGLCD47_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD47_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD47_SHIFT);
  (void)LCD_WF8B_BPGLCD23_MASK;
  (void)LCD_WF8B_BPGLCD23_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD23_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD23_SHIFT);
  (void)LCD_WF8B_BPGLCD24_MASK;
  (void)LCD_WF8B_BPGLCD24_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD24_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD24_SHIFT);
  (void)LCD_WF8B_BPGLCD25_MASK;
  (void)LCD_WF8B_BPGLCD25_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD25_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD25_SHIFT);
  (void)LCD_WF8B_BPGLCD46_MASK;
  (void)LCD_WF8B_BPGLCD46_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD46_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD46_SHIFT);
  (void)LCD_WF8B_BPGLCD26_MASK;
  (void)LCD_WF8B_BPGLCD26_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD26_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD26_SHIFT);
  (void)LCD_WF8B_BPGLCD27_MASK;
  (void)LCD_WF8B_BPGLCD27_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD27_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD27_SHIFT);
  (void)LCD_WF8B_BPGLCD10_MASK;
  (void)LCD_WF8B_BPGLCD10_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD10_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD10_SHIFT);
  (void)LCD_WF8B_BPGLCD45_MASK;
  (void)LCD_WF8B_BPGLCD45_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD45_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD45_SHIFT);
  (void)LCD_WF8B_BPGLCD28_MASK;
  (void)LCD_WF8B_BPGLCD28_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD28_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD28_SHIFT);
  (void)LCD_WF8B_BPGLCD29_MASK;
  (void)LCD_WF8B_BPGLCD29_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD29_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD29_SHIFT);
  (void)LCD_WF8B_BPGLCD4_MASK;
  (void)LCD_WF8B_BPGLCD4_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD4_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD4_SHIFT);
  (void)LCD_WF8B_BPGLCD44_MASK;
  (void)LCD_WF8B_BPGLCD44_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD44_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD44_SHIFT);
  (void)LCD_WF8B_BPGLCD30_MASK;
  (void)LCD_WF8B_BPGLCD30_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD30_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD30_SHIFT);
  (void)LCD_WF8B_BPGLCD2_MASK;
  (void)LCD_WF8B_BPGLCD2_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD2_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD2_SHIFT);
  (void)LCD_WF8B_BPGLCD31_MASK;
  (void)LCD_WF8B_BPGLCD31_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD31_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD31_SHIFT);
  (void)LCD_WF8B_BPGLCD43_MASK;
  (void)LCD_WF8B_BPGLCD43_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD43_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD43_SHIFT);
  (void)LCD_WF8B_BPGLCD32_MASK;
  (void)LCD_WF8B_BPGLCD32_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD32_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD32_SHIFT);
  (void)LCD_WF8B_BPGLCD33_MASK;
  (void)LCD_WF8B_BPGLCD33_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD33_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD33_SHIFT);
  (void)LCD_WF8B_BPGLCD42_MASK;
  (void)LCD_WF8B_BPGLCD42_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD42_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD42_SHIFT);
  (void)LCD_WF8B_BPGLCD34_MASK;
  (void)LCD_WF8B_BPGLCD34_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD34_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD34_SHIFT);
  (void)LCD_WF8B_BPGLCD11_MASK;
  (void)LCD_WF8B_BPGLCD11_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD11_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD11_SHIFT);
  (void)LCD_WF8B_BPGLCD35_MASK;
  (void)LCD_WF8B_BPGLCD35_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD35_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD35_SHIFT);
  (void)LCD_WF8B_BPGLCD12_MASK;
  (void)LCD_WF8B_BPGLCD12_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD12_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD12_SHIFT);
  (void)LCD_WF8B_BPGLCD41_MASK;
  (void)LCD_WF8B_BPGLCD41_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD41_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD41_SHIFT);
  (void)LCD_WF8B_BPGLCD36_MASK;
  (void)LCD_WF8B_BPGLCD36_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD36_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD36_SHIFT);
  (void)LCD_WF8B_BPGLCD3_MASK;
  (void)LCD_WF8B_BPGLCD3_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD3_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD3_SHIFT);
  (void)LCD_WF8B_BPGLCD37_MASK;
  (void)LCD_WF8B_BPGLCD37_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD37_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD37_SHIFT);
  (void)LCD_WF8B_BPGLCD40_MASK;
  (void)LCD_WF8B_BPGLCD40_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD40_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD40_SHIFT);
  (void)LCD_WF8B_BPGLCD38_MASK;
  (void)LCD_WF8B_BPGLCD38_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD38_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD38_SHIFT);
  (void)LCD_WF8B_BPGLCD39_MASK;
  (void)LCD_WF8B_BPGLCD39_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPGLCD39_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPGLCD39_SHIFT);
  (void)LCD_WF8B_BPHLCD63_MASK;
  (void)LCD_WF8B_BPHLCD63_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD63_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD63_SHIFT);
  (void)LCD_WF8B_BPHLCD62_MASK;
  (void)LCD_WF8B_BPHLCD62_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD62_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD62_SHIFT);
  (void)LCD_WF8B_BPHLCD61_MASK;
  (void)LCD_WF8B_BPHLCD61_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD61_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD61_SHIFT);
  (void)LCD_WF8B_BPHLCD60_MASK;
  (void)LCD_WF8B_BPHLCD60_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD60_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD60_SHIFT);
  (void)LCD_WF8B_BPHLCD59_MASK;
  (void)LCD_WF8B_BPHLCD59_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD59_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD59_SHIFT);
  (void)LCD_WF8B_BPHLCD58_MASK;
  (void)LCD_WF8B_BPHLCD58_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD58_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD58_SHIFT);
  (void)LCD_WF8B_BPHLCD57_MASK;
  (void)LCD_WF8B_BPHLCD57_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD57_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD57_SHIFT);
  (void)LCD_WF8B_BPHLCD0_MASK;
  (void)LCD_WF8B_BPHLCD0_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD0_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD0_SHIFT);
  (void)LCD_WF8B_BPHLCD56_MASK;
  (void)LCD_WF8B_BPHLCD56_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD56_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD56_SHIFT);
  (void)LCD_WF8B_BPHLCD55_MASK;
  (void)LCD_WF8B_BPHLCD55_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD55_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD55_SHIFT);
  (void)LCD_WF8B_BPHLCD54_MASK;
  (void)LCD_WF8B_BPHLCD54_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD54_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD54_SHIFT);
  (void)LCD_WF8B_BPHLCD53_MASK;
  (void)LCD_WF8B_BPHLCD53_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD53_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD53_SHIFT);
  (void)LCD_WF8B_BPHLCD52_MASK;
  (void)LCD_WF8B_BPHLCD52_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD52_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD52_SHIFT);
  (void)LCD_WF8B_BPHLCD51_MASK;
  (void)LCD_WF8B_BPHLCD51_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD51_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD51_SHIFT);
  (void)LCD_WF8B_BPHLCD50_MASK;
  (void)LCD_WF8B_BPHLCD50_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD50_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD50_SHIFT);
  (void)LCD_WF8B_BPHLCD1_MASK;
  (void)LCD_WF8B_BPHLCD1_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD1_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD1_SHIFT);
  (void)LCD_WF8B_BPHLCD49_MASK;
  (void)LCD_WF8B_BPHLCD49_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD49_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD49_SHIFT);
  (void)LCD_WF8B_BPHLCD48_MASK;
  (void)LCD_WF8B_BPHLCD48_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD48_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD48_SHIFT);
  (void)LCD_WF8B_BPHLCD47_MASK;
  (void)LCD_WF8B_BPHLCD47_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD47_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD47_SHIFT);
  (void)LCD_WF8B_BPHLCD46_MASK;
  (void)LCD_WF8B_BPHLCD46_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD46_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD46_SHIFT);
  (void)LCD_WF8B_BPHLCD45_MASK;
  (void)LCD_WF8B_BPHLCD45_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD45_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD45_SHIFT);
  (void)LCD_WF8B_BPHLCD44_MASK;
  (void)LCD_WF8B_BPHLCD44_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD44_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD44_SHIFT);
  (void)LCD_WF8B_BPHLCD43_MASK;
  (void)LCD_WF8B_BPHLCD43_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD43_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD43_SHIFT);
  (void)LCD_WF8B_BPHLCD2_MASK;
  (void)LCD_WF8B_BPHLCD2_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD2_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD2_SHIFT);
  (void)LCD_WF8B_BPHLCD42_MASK;
  (void)LCD_WF8B_BPHLCD42_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD42_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD42_SHIFT);
  (void)LCD_WF8B_BPHLCD41_MASK;
  (void)LCD_WF8B_BPHLCD41_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD41_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD41_SHIFT);
  (void)LCD_WF8B_BPHLCD40_MASK;
  (void)LCD_WF8B_BPHLCD40_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD40_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD40_SHIFT);
  (void)LCD_WF8B_BPHLCD39_MASK;
  (void)LCD_WF8B_BPHLCD39_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD39_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD39_SHIFT);
  (void)LCD_WF8B_BPHLCD38_MASK;
  (void)LCD_WF8B_BPHLCD38_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD38_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD38_SHIFT);
  (void)LCD_WF8B_BPHLCD37_MASK;
  (void)LCD_WF8B_BPHLCD37_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD37_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD37_SHIFT);
  (void)LCD_WF8B_BPHLCD36_MASK;
  (void)LCD_WF8B_BPHLCD36_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD36_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD36_SHIFT);
  (void)LCD_WF8B_BPHLCD3_MASK;
  (void)LCD_WF8B_BPHLCD3_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD3_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD3_SHIFT);
  (void)LCD_WF8B_BPHLCD35_MASK;
  (void)LCD_WF8B_BPHLCD35_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD35_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD35_SHIFT);
  (void)LCD_WF8B_BPHLCD34_MASK;
  (void)LCD_WF8B_BPHLCD34_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD34_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD34_SHIFT);
  (void)LCD_WF8B_BPHLCD33_MASK;
  (void)LCD_WF8B_BPHLCD33_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD33_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD33_SHIFT);
  (void)LCD_WF8B_BPHLCD32_MASK;
  (void)LCD_WF8B_BPHLCD32_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD32_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD32_SHIFT);
  (void)LCD_WF8B_BPHLCD31_MASK;
  (void)LCD_WF8B_BPHLCD31_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD31_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD31_SHIFT);
  (void)LCD_WF8B_BPHLCD30_MASK;
  (void)LCD_WF8B_BPHLCD30_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD30_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD30_SHIFT);
  (void)LCD_WF8B_BPHLCD29_MASK;
  (void)LCD_WF8B_BPHLCD29_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD29_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD29_SHIFT);
  (void)LCD_WF8B_BPHLCD4_MASK;
  (void)LCD_WF8B_BPHLCD4_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD4_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD4_SHIFT);
  (void)LCD_WF8B_BPHLCD28_MASK;
  (void)LCD_WF8B_BPHLCD28_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD28_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD28_SHIFT);
  (void)LCD_WF8B_BPHLCD27_MASK;
  (void)LCD_WF8B_BPHLCD27_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD27_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD27_SHIFT);
  (void)LCD_WF8B_BPHLCD26_MASK;
  (void)LCD_WF8B_BPHLCD26_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD26_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD26_SHIFT);
  (void)LCD_WF8B_BPHLCD25_MASK;
  (void)LCD_WF8B_BPHLCD25_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD25_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD25_SHIFT);
  (void)LCD_WF8B_BPHLCD24_MASK;
  (void)LCD_WF8B_BPHLCD24_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD24_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD24_SHIFT);
  (void)LCD_WF8B_BPHLCD23_MASK;
  (void)LCD_WF8B_BPHLCD23_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD23_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD23_SHIFT);
  (void)LCD_WF8B_BPHLCD22_MASK;
  (void)LCD_WF8B_BPHLCD22_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD22_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD22_SHIFT);
  (void)LCD_WF8B_BPHLCD5_MASK;
  (void)LCD_WF8B_BPHLCD5_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD5_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD5_SHIFT);
  (void)LCD_WF8B_BPHLCD21_MASK;
  (void)LCD_WF8B_BPHLCD21_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD21_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD21_SHIFT);
  (void)LCD_WF8B_BPHLCD20_MASK;
  (void)LCD_WF8B_BPHLCD20_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD20_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD20_SHIFT);
  (void)LCD_WF8B_BPHLCD19_MASK;
  (void)LCD_WF8B_BPHLCD19_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD19_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD19_SHIFT);
  (void)LCD_WF8B_BPHLCD18_MASK;
  (void)LCD_WF8B_BPHLCD18_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD18_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD18_SHIFT);
  (void)LCD_WF8B_BPHLCD17_MASK;
  (void)LCD_WF8B_BPHLCD17_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD17_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD17_SHIFT);
  (void)LCD_WF8B_BPHLCD16_MASK;
  (void)LCD_WF8B_BPHLCD16_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD16_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD16_SHIFT);
  (void)LCD_WF8B_BPHLCD15_MASK;
  (void)LCD_WF8B_BPHLCD15_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD15_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD15_SHIFT);
  (void)LCD_WF8B_BPHLCD6_MASK;
  (void)LCD_WF8B_BPHLCD6_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD6_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD6_SHIFT);
  (void)LCD_WF8B_BPHLCD14_MASK;
  (void)LCD_WF8B_BPHLCD14_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD14_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD14_SHIFT);
  (void)LCD_WF8B_BPHLCD13_MASK;
  (void)LCD_WF8B_BPHLCD13_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD13_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD13_SHIFT);
  (void)LCD_WF8B_BPHLCD12_MASK;
  (void)LCD_WF8B_BPHLCD12_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD12_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD12_SHIFT);
  (void)LCD_WF8B_BPHLCD11_MASK;
  (void)LCD_WF8B_BPHLCD11_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD11_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD11_SHIFT);
  (void)LCD_WF8B_BPHLCD10_MASK;
  (void)LCD_WF8B_BPHLCD10_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD10_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD10_SHIFT);
  (void)LCD_WF8B_BPHLCD9_MASK;
  (void)LCD_WF8B_BPHLCD9_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD9_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD9_SHIFT);
  (void)LCD_WF8B_BPHLCD8_MASK;
  (void)LCD_WF8B_BPHLCD8_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD8_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD8_SHIFT);
  (void)LCD_WF8B_BPHLCD7_MASK;
  (void)LCD_WF8B_BPHLCD7_SHIFT;
  LCD_WF0 |= LCD_WF8B_BPHLCD7_MASK;
  LCD_WF0 &= ~(1U << LCD_WF8B_BPHLCD7_SHIFT);
}

